app/views/dashboard/index.html.erb

              <div class="text-center">
                <h3><%= current_user.organization.users.minors.count %></h3>
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."organization_id" = $1 AND (age < 18)  [["organization_id", 1]]

              <div class="text-center">
                <h3><%= current_user.organization.users.adults.count %></h3>
---
SELECT COUNT(*) FROM "users" WHERE "users"."organization_id" = $1 AND (age >= 18)  [["organization_id", 1]]