app/views/users/index.html.erb

                  <td>
                    <% user.roles.limit(3).each do |role| %>
---
SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 3]]

                    <% end %>
                    <% if user.roles.count > 3 %>
---
SELECT COUNT(*) FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]