app/views/users/new.html.erb

            <%= form.label :organization_id, class: 'form-label' %>
            <%= form.select :organization_id,
                options_from_collection_for_select(Organization.all, :id, :name, @user.organization_id),
                { prompt: 'Select an organization (optional)' },
                class: 'form-control' %>
---
SELECT "organizations".* FROM "organizations"