app/views/users/roles.html.erb

            <h6>Current Roles</h6>
            <% if @user.roles.any? %>
              <% @user.roles.each do |role| %>
---
SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]
SELECT 1 AS one FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

                <%= form.label :resource_id, 'Organization (Optional)', class: 'form-label' %>
                <%= form.select :resource_id,
                    options_from_collection_for_select(Organization.all, :id, :name),
                    { prompt: 'Select an organization (optional)' },
                    class: 'form-control' %>
---
SELECT "organizations".* FROM "organizations"


        <p><strong>Total Roles:</strong> <%= @user.roles.count %></p>
---
SELECT COUNT(*) FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]