app/views/users/show.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]
SELECT 1 AS one FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
      <div class="card-body">
        <% if @user.roles.any? %>
          <% @user.roles.each do |role| %>