app/views/parental_consents/new.html.erb

              <%= form.label :parent_id, 'Parent/Guardian', class: 'form-label' %>
              <%= form.select :parent_id,
                  options_from_collection_for_select(User.adults, :id, :full_name_with_age, @parental_consent.parent_id),
                  { prompt: 'Select a parent/guardian' },
                  class: 'form-control' %>
---
SELECT "users".* FROM "users" WHERE (age < 18)

            <%= form.label :child_id, 'Child/Minor', class: 'form-label' %>
            <%= form.select :child_id,
                options_from_collection_for_select(User.minors, :id, :full_name_with_age, @parental_consent.child_id),
                { prompt: 'Select a child/minor' },
                class: 'form-control' %>
---
SELECT "users".* FROM "users" WHERE (age < 18)