app/controllers/organizations_controller.rb

  def show
    authorize @organization
    @members = @organization.users.includes(:roles)
    @analytics = @organization.organization_analytics.recent.first
---
SELECT "users".* FROM "users" WHERE "users"."organization_id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["organization_id", 1], ["LIMIT", 5]]

  def members
    authorize @organization

    @users = @organization.users.includes(:roles, :parental_consent)
    @members_by_role = @users.joins(:roles).group('roles.name').count
---
SELECT "user_roles".* FROM "user_roles" WHERE "user_roles"."user_id" IN ($1, $2)  [["user_id", 1], ["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."organization_id" = $1  [["organization_id", 1]]
SELECT COUNT(DISTINCT "users"."id") AS count_id, roles.name AS roles_name FROM "users" INNER JOIN "user_roles" ON "user_roles"."user_id" = "users"."id" INNER JOIN "roles" ON "roles"."id" = "user_roles"."role_id" LEFT OUTER JOIN "parental_consents" ON "parental_consents"."child_id" = "users"."id" WHERE "users"."organization_id" = $1 GROUP BY roles.name  [["organization_id", 1]]

  def participation_rules
    authorize @organization

    @participation_rules = @organization.participation_rules.includes(:organization)
---
SELECT "participation_rules".* FROM "participation_rules" WHERE "participation_rules"."organization_id" = $1  [["organization_id", 1]]

  def set_organization
    @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]