app/controllers/parental_consents_controller.rb

  def create
    # Build parental consent from params
    @parental_consent = ParentalConsent.new(parental_consent_params)

    # Set the parent to current user if they're an adult and no parent is specified
    if current_user.adult? && @parental_consent.parent_id.blank?
      @parental_consent.parent = current_user
    end

    # Set the child if child_id is provided
    if params[:parental_consent][:child_id].present?
      child = User.find(params[:parental_consent][:child_id])
      @parental_consent.child = child
    end



    authorize @parental_consent

    if @parental_consent.save
---
SELECT 1 AS one FROM "parental_consents" WHERE "parental_consents"."child_id" = $1 LIMIT $2  [["child_id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "parental_consents" ("parent_id", "child_id", "consent_date", "expiry_date", "notes", "consent_details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_parental_consent
    @parental_consent = ParentalConsent.find(params[:id])
---
SELECT "parental_consents".* FROM "parental_consents" WHERE "parental_consents"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]