app/controllers/participation_rules_controller.rb

  def set_organization
    @organization = Organization.find(params[:organization_id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]