app/controllers/users_controller.rb

SELECT "user_roles".* FROM "user_roles" WHERE "user_roles"."user_id" IN ($1, $2)  [["user_id", 1], ["user_id", 2]]
---
  def index
    @users = policy_scope(User).includes(:organization, :roles)

SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]
---
  def show
    authorize @user
    @roles = @user.roles.includes(:resource)

SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 1]]
---
  def roles
    authorize @user
    @available_roles = Role.default_roles
    @user_roles = @user.roles.includes(:resource)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:id])