app/models/organization_analytics.rb

  def self.generate_daily_report(organization)
    analytics = organization.generate_analytics

    # Calculate additional metrics safely
    begin
      analytics.update!(
        active_users_7_days: organization.users.joins(:user_roles).joins(:roles).where('user_roles.created_at >= ?', 7.days.ago).distinct.count,
        active_users_30_days: organization.users.joins(:user_roles).joins(:roles).where('user_roles.created_at >= ?', 30.days.ago).distinct.count,
        new_members_this_month: organization.users.where('created_at >= ?', 1.month.ago).count,
        members_by_role: organization.users.joins(:user_roles).joins(:roles).group('roles.name').count,
        average_age: organization.users.average(:age)&.round(1) || 0,
        minor_percentage: organization.users.count > 0 ? (organization.users.minors.count.to_f / organization.users.count * 100).round(2) : 0
      )
---
SELECT COUNT(DISTINCT "users"."id") FROM "users" INNER JOIN "user_roles" ON "user_roles"."user_id" = "users"."id" INNER JOIN "user_roles" "user_roles_users_join" ON "user_roles_users_join"."user_id" = "users"."id" INNER JOIN "roles" ON "roles"."id" = "user_roles_users_join"."role_id" WHERE "users"."organization_id" = $1 AND (user_roles.created_at >= '2025-07-02 18:57:04.649830')  [["organization_id", 1]]
UPDATE "organization_analytics" SET "active_users_7_days" = $1, "active_users_30_days" = $2, "new_members_this_month" = $3, "members_by_role" = $4, "average_age" = $5, "minor_percentage" = $6, "updated_at" = $7 WHERE "organization_analytics"."id" = $8

  def self.generate_weekly_report(organization)
    start_date = 1.week.ago.beginning_of_week
    end_date = start_date.end_of_week

    analytics = organization.organization_analytics.create!(
      total_members: organization.member_count,
      admin_count: organization.admin_count,
      age_group_breakdown: organization.member_count_by_age_group,
      participation_rate: organization.calculate_participation_rate,
      generated_at: Time.current,
      report_period: 'weekly',
      period_start: start_date,
      period_end: end_date,
      new_members_count: organization.users.where(created_at: start_date..end_date).count,
      active_members_count: organization.users.joins(:user_roles).joins(:roles).where('user_roles.created_at >= ?', start_date).distinct.count
    )
---
INSERT INTO "organization_analytics" ("organization_id", "total_members", "admin_count", "age_group_breakdown", "participation_rate", "generated_at", "report_period", "period_start", "period_end", "active_members_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT COUNT(DISTINCT "users"."id") FROM "users" INNER JOIN "user_roles" ON "user_roles"."user_id" = "users"."id" INNER JOIN "user_roles" "user_roles_users_join" ON "user_roles_users_join"."user_id" = "users"."id" INNER JOIN "roles" ON "roles"."id" = "user_roles_users_join"."role_id" WHERE "users"."organization_id" = $1 AND (user_roles.created_at >= '2025-06-30 00:00:00')  [["organization_id", 1]]

  def self.generate_monthly_report(organization)
    start_date = 1.month.ago.beginning_of_month
    end_date = start_date.end_of_month

    analytics = organization.organization_analytics.create!(
      total_members: organization.member_count,
      admin_count: organization.admin_count,
      age_group_breakdown: organization.member_count_by_age_group,
      participation_rate: organization.calculate_participation_rate,
      generated_at: Time.current,
      report_period: 'monthly',
      period_start: start_date,
      period_end: end_date,
      new_members_count: organization.users.where(created_at: start_date..end_date).count,
      active_members_count: organization.users.joins(:user_roles).joins(:roles).where('user_roles.created_at >= ?', start_date).distinct.count
    )
---
INSERT INTO "organization_analytics" ("organization_id", "total_members", "admin_count", "age_group_breakdown", "participation_rate", "generated_at", "report_period", "period_start", "period_end", "active_members_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT COUNT(DISTINCT "users"."id") FROM "users" INNER JOIN "user_roles" ON "user_roles"."user_id" = "users"."id" INNER JOIN "user_roles" "user_roles_users_join" ON "user_roles_users_join"."user_id" = "users"."id" INNER JOIN "roles" ON "roles"."id" = "user_roles_users_join"."role_id" WHERE "users"."organization_id" = $1 AND (user_roles.created_at >= '2025-06-01 00:00:00')  [["organization_id", 1]]

  def growth_rate
    return 0 if total_members.zero?

    previous_analytics = organization.organization_analytics
      .where('generated_at < ?', generated_at)
      .order(generated_at: :desc)
      .first
---
SELECT "organization_analytics".* FROM "organization_analytics" WHERE "organization_analytics"."organization_id" = $1 AND (generated_at < '2025-07-09 18:57:04.716264') ORDER BY "organization_analytics"."generated_at" DESC LIMIT $2  [["organization_id", 1], ["LIMIT", 1]]