app/models/organization.rb

  def generate_analytics
    analytics = organization_analytics.create!(
      total_members: member_count,
      admin_count: admin_count,
      age_group_breakdown: member_count_by_age_group,
      participation_rate: calculate_participation_rate,
      generated_at: Time.current
    )
---
INSERT INTO "organization_analytics" ("organization_id", "total_members", "admin_count", "age_group_breakdown", "participation_rate", "generated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"