app/models/parental_consent.rb

  def self.create_for_minor(child, parent)
---
INSERT INTO "parental_consents" ("parent_id", "child_id", "consent_date", "expiry_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["parent_id", 13], ["child_id", 15], ["consent_date", "2025-07-09"], ["expiry_date", "2026-07-09"], ["created_at", "2025-07-09 15:25:37.219045"], ["updated_at", "2025-07-09 15:25:37.219045"]]

  def notify_organization_admins
    return unless child.organization

    child.organization.users.joins(:roles).where(roles: { name: 'admin' }).each do |admin|
---
SELECT "users".* FROM "users" INNER JOIN "users_roles" ON "users_roles"."user_id" = "users"."id" INNER JOIN "roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users"."organization_id" = $1 AND "roles"."name" = $2  [["organization_id", 5], ["name", "admin"]]