app/models/participation_rule.rb

  def self.default_rules_for_organization(organization)
    AGE_GROUPS.map do |age_group, age_range|
      organization.participation_rules.create!(
        age_group: age_group,
        minimum_age: age_range[:min],
        maximum_age: age_range[:max],
        enabled: true,
        requires_parental_consent: age_group == :child || age_group == :teen,
        content_filtering_level: content_filtering_for_age_group(age_group),
        participation_restrictions: restrictions_for_age_group(age_group)
      )
---
INSERT INTO "participation_rules" ("organization_id", "age_group", "minimum_age", "maximum_age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["organization_id", 1], ["age_group", "young_adult"], ["minimum_age", 18], ["maximum_age", 25], ["created_at", "2025-07-09 14:50:52.918433"], ["updated_at", "2025-07-09 14:50:52.918433"]]