app/models/user_role.rb

INSERT INTO "roles" ("name", "resource_type", "resource_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "admin"], ["resource_type", "Organization"], ["resource_id", 1], ["created_at", "2025-07-09 15:37:06.587863"], ["updated_at", "2025-07-09 15:37:06.587863"]]
---
  def self.assign_role(user, role_name, resource = nil)
    role = Role.find_or_create_by(name: role_name, resource: resource)

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 AND "roles"."resource_id" IS NULL LIMIT $2  [["name", "admin"], ["LIMIT", 1]]
SELECT 1 AS one FROM "user_roles" WHERE "user_roles"."user_id" = $1 AND "user_roles"."role_id" = $2 LIMIT $3  [["user_id", 1], ["role_id", 1], ["LIMIT", 1]]
---
  def self.has_role?(user, role_name, resource = nil)
    role = Role.find_by(name: role_name, resource: resource)
    where(user: user, role: role).exists? if role