app/views/organizations/show.html.erb

SELECT COUNT(*) FROM "users" WHERE "users"."organization_id" = $1  [["organization_id", 1]]
---
                <div class="text-center">
                  <div class="metric-value text-primary"><%= @organization.users.count %></div>

SELECT COUNT(*) FROM "users" WHERE "users"."organization_id" = $1 AND (age >= 18)  [["organization_id", 1]]
---
                <div class="text-center">
                  <div class="metric-value text-success"><%= @organization.users.adults.count %></div>

SELECT COUNT(*) FROM "users" WHERE "users"."organization_id" = $1 AND (age < 18)  [["organization_id", 1]]
---
                <div class="text-center">
                  <div class="metric-value text-warning"><%= @organization.users.minors.count %></div>

SELECT COUNT(*) FROM "participation_rules" WHERE "participation_rules"."organization_id" = $1  [["organization_id", 1]]
---
                <div class="text-center">
                  <div class="metric-value text-info"><%= @organization.participation_rules.count %></div>

SELECT "users".* FROM "users" WHERE "users"."organization_id" = $1 ORDER BY "users"."created_at" DESC LIMIT $2  [["organization_id", 1], ["LIMIT", 5]]
---
      <div class="card-body">
        <% @organization.users.order(created_at: :desc).limit(5).each do |user| %>

SELECT COUNT(*) FROM "users" WHERE "users"."organization_id" = $1  [["organization_id", 1]]
---

        <% if @organization.users.count > 5 %>

SELECT "participation_rules".* FROM "participation_rules" WHERE "participation_rules"."organization_id" = $1 LIMIT $2  [["organization_id", 1], ["LIMIT", 3]]
---
      <div class="card-body">
        <% @organization.participation_rules.limit(3).each do |rule| %>